# 1. Pandas Basic
* Series
* DataFrame

In [1]:
import pandas as pd

In [2]:
my_list = ['AAPL', 'AMZN', 'T']
my_list

['AAPL', 'AMZN', 'T']

In [7]:
label = ['stock#1', 'stock#2', 'stock#3']
label

['stock#1', 'stock#2', 'stock#3']

In [4]:
type(label)

list

In [5]:
type(my_list)

list

In [8]:
# Series is formed fo data and associated labels
x_series = pd.Series(data = my_list, index=label)
x_series

stock#1    AAPL
stock#2    AMZN
stock#3       T
dtype: object

In [10]:
type(x_series) # pandas.core.series.Series

pandas.core.series.Series

In [16]:
bank_client_df = pd.DataFrame({'Bank client Id': [111, 222, 333, 444],
                               'Bank client Name': [ 'Chanel', 'Steve', 'Mitch', 'Ryan'],
                               'Net Worth [$]': [3500, 29000, 10000, 2000],
                               'Years with bank': [3, 4, 9, 5]
                              })
bank_client_df

   Bank client Id Bank client Name  Net Worth [$]  Years with bank
0             111           Chanel           3500                3
1             222            Steve          29000                4
2             333            Mitch          10000                9
3             444             Ryan           2000                5

In [14]:
type(bank_client_df) # pandas.core.frame.DataFrame

pandas.core.frame.DataFrame

In [17]:
bank_client_df.values

array([[111, 'Chanel', 3500, 3],
       [222, 'Steve', 29000, 4],
       [333, 'Mitch', 10000, 9],
       [444, 'Ryan', 2000, 5]], dtype=object)

In [18]:
bank_client_df.index

RangeIndex(start=0, stop=4, step=1)

In [19]:
bank_client_df.columns

Index(['Bank client Id', 'Bank client Name', 'Net Worth [$]',
       'Years with bank'],
      dtype='object')

In [20]:
bank_client_df.head(2) # only two rows

   Bank client Id Bank client Name  Net Worth [$]  Years with bank
0             111           Chanel           3500                3
1             222            Steve          29000                4

In [21]:
bank_client_df.tail(1)

   Bank client Id Bank client Name  Net Worth [$]  Years with bank
3             444             Ryan           2000                5

### Mini Challenge #1:
* A portfolio contains a collection of securites such as stocks, bonds and ETFs. Define a dataframe named 'portfolio_df' that holds 3 different stock ticker sympols, number of shares, and price per share.
* Calculae the total value of the portfolio including all stocks.

In [29]:
portfolio_df = pd.DataFrame({'ticker':['AAPL', 'AMZN', 'T'],
                         'shares':[200, 300, 130],
                         'price':[20, 10, 30]
                        })
portfolio_df

  ticker  shares  price
0   AAPL     200     20
1   AMZN     300     10
2      T     130     30

In [32]:
stocks_value = portfolio_df['shares'] * portfolio_df['price']
print(stocks_value)
print(f'Total protfolio value {stocks_value.sum()}')

0    4000
1    3000
2    3900
dtype: int64
Total protfolio value 10900

# 2. Pandas with CSV and HTML Data